# NewValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComboBoxCurrentChangedEventArgs..::..NewValue Property
ComboBoxCurrentChangedEventArgs Class See Also
---
The current item for the ComboBox after the change.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ComboBoxMember NewValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NewValue As ComboBoxMember
	Get
```

Visual C++
---
```text
public:
property ComboBoxMember^ NewValue {
	ComboBoxMember^ get ();
}
```

# See Also
ComboBoxCurrentChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace